```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_firebase_android_app_config.release will be read during apply
  # (config refers to values not yet known)
 <= data "google_firebase_android_app_config" "release" {
      + app_id               = (known after apply)
      + config_file_contents = (known after apply)
      + config_filename      = (known after apply)
      + id                   = (known after apply)
    }

  # github_actions_secret.main["FIREBASE_ANDROID_APP_ID"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at      = "2025-08-12 18:39:54 +0000 UTC" -> (known after apply)
      ~ id              = "playground.ashdavies.dev:FIREBASE_ANDROID_APP_ID" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2025-08-12 18:39:54 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["FIREBASE_GOOGLE_SERVICES"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at      = "2025-08-12 18:39:56 +0000 UTC" -> (known after apply)
      ~ id              = "playground.ashdavies.dev:FIREBASE_GOOGLE_SERVICES" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2025-08-12 18:39:56 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # google_firebase_android_app.release must be replaced
-/+ resource "google_firebase_android_app" "release" {
      ~ api_key_id      = "ecc12a8f-74fe-4f10-bede-c60d4b5db5e3" -> (known after apply)
      ~ app_id          = "1:279861227938:android:4eb258d9c4f92763c502fb" -> (known after apply)
      ~ display_name    = "Playground Release" -> "Playground Debug"
      ~ etag            = "1_07ee9cd9-3616-4f39-9ffc-dc6b2c050a50" -> (known after apply)
      ~ id              = "projects/playground-1a136/androidApps/1:279861227938:android:4eb258d9c4f92763c502fb" -> (known after apply)
      ~ name            = "projects/playground-1a136/androidApps/1:279861227938:android:4eb258d9c4f92763c502fb" -> (known after apply)
      ~ package_name    = "dev.ashdavies.playground" -> "dev.ashdavies.playground.debug" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->